Catalogs/ra_KontrolnyeMeropriyatiya.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ra_KontrolnyeMeropriyatiya</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>VidPredmetaNesootvetstviya</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ra_VidyPredmetovNesootvetstviya</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NaimenovanieEn</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OblastPrimeneniya</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ra_OblastiPrimeneniya</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NormativnyjSrokProvedeniya</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Primenenie</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>EhtapVyyavleniya</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ra_EhtapyVyyavleniyaNesootvetstvij</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ra_KontrolnyeMeropriyatiya/Ext/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") И
			Параметры.Отбор.Свойство("EhtapVyyavleniya") И
			Параметры.Отбор.Свойство("ЭтоГруппа") Тогда
				
		СтандартнаяОбработка = Ложь;
	
		МассивПолей = ра_ОбщегоНазначения.ПолучитьПоляВводаПоСтроке(ПустаяСсылка().Метаданные());
		
		Запрос = ра_ОбщегоНазначения.ЗапросДанныхВыбораПоТексту(
			"ВЫБРАТЬ
			|	ra_KontrolnyeMeropriyatiya.Ссылка КАК Ссылка,
			|	ra_KontrolnyeMeropriyatiya.Код КАК Код,
			|	ra_KontrolnyeMeropriyatiya.Наименование КАК Наименование,
			|	ra_KontrolnyeMeropriyatiya.ПометкаУдаления КАК ПометкаУдаления
			|ИЗ
			|	Справочник.ra_KontrolnyeMeropriyatiya.Primenenie КАК ra_KontrolnyeMeropriyatiyaPrimenenie
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ra_KontrolnyeMeropriyatiya КАК ra_KontrolnyeMeropriyatiya
			|		ПО ra_KontrolnyeMeropriyatiyaPrimenenie.Ссылка = ra_KontrolnyeMeropriyatiya.Ссылка
			|			И ra_KontrolnyeMeropriyatiyaPrimenenie.EhtapVyyavleniya = &EhtapVyyavleniya
			|ГДЕ
			|	ra_KontrolnyeMeropriyatiyaPrimenenie.Ссылка.ЭтоГруппа",
			Параметры,
			МассивПолей);
												
		ра_ОбщегоНазначения.ЗаполнитьДанныеВыбораПоЗапросу(ДанныеВыбора, Параметры, Запрос, МассивПолей, СтрСоединить(МассивПолей, ","));
		
	ИначеЕсли Параметры.Свойство("Отбор") И
			Параметры.Отбор.Свойство("VidPredmetaNesootvetstviya") И
			Параметры.Отбор.Свойство("Родитель") Тогда
						
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Для каждого КлючИЗнач из Данные Цикл
		Представление = КлючИЗнач.Значение;	
	КонецЦикла;
	
	ра_ОбщегоНазначения.ОбработатьПустоеПредставление(Представление);
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ТекущийЯзык() = Метаданные.Языки.Английский Тогда
		Поля.Добавить("NaimenovanieEn");	
	Иначе
		Поля.Добавить("Наименование");	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ИнтеграцияBitrix

Процедура СформироватьМассивДанныхGetList(Результат, ПолноеИмя, ПараметрыЗапросаHTTP) Экспорт
	
	ОбъектМетаданных = Метаданные.Справочники.ra_VidyKontrolnyhOperacij;
	
	ТаблицаРеквизитов = ра_ОбменДанными.ПолучитьТаблицуРеквизитовОбъекта(ОбъектМетаданных);
	
	АктуализироватьТаблицуРеквизитов(ТаблицаРеквизитов);
	
	ТекстЗапросаВложенныеТаблицы = ПолучитьТекстЗапросаВложенныеТаблицы();
	ТекстЗапросаСоединений = ПолучитьТекстЗапросаСоединений();
	
	Запрос = ра_ОбменДанными.ПолучитьЗапрос(ТаблицаРеквизитов, ПараметрыЗапросаHTTP, ПолноеИмя, ТекстЗапросаВложенныеТаблицы, ТекстЗапросаСоединений);
	
	МассивДанных = ра_ОбменДанными.СформироватьМассивДанныхИзЗапроса(Запрос);
	Результат.Вставить("value", МассивДанных);
							
КонецПроцедуры

Процедура АктуализироватьТаблицуРеквизитов(ТаблицаРеквизитов)
		
	
	
КонецПроцедуры

Функция ПолучитьТекстЗапросаВложенныеТаблицы() Экспорт
	
	Возврат "";
			
КонецФункции

Функция ПолучитьТекстЗапросаСоединений() Экспорт
	
	Возврат "";
			
КонецФункции

#КонецОбласти
